import lib.BaseFunction
import lib.AsciArt

_B = "[1m"
_N = "[22m"
_D = "[2m"
_reset = "[0m"
_UN = "\033[4m"
_fw = "[37m"
_fy = "[33m"
_fb = "[34m"
_fbl = "[30m"
_fr = "[31m"
_fc = "[36m"
_fg = "[32m"
_fm = "[35m"
_fEx_w = "[97m"
_fEx_y = "[93m"
_fEx_b = "[94m"
_fEx_bl = "[90m"
_fEx_r = "[91m"
_fEx_c = "[96m"
_fEx_g = "[92m"
_fEx_m = "[95m"


_bw = "[47m"
_by = "[43m"
_bb = "[44m"
_bbl = "[40m"
_br = "[41m"
_bc = "[46m"
_bg = "[42m"
_bm = "[45m"
_brst = "[49m"
_bEx_w = "[107m"
_bEx_y = "[103m"
_bEx_b = "[104m"
_bEx_bl = "[100m"
_bEx_r = "[101m"
_bEx_c = "[106m"
_bEx_g = "[102m"
_bEx_m = "[105m"


COLOR_LIST = ['_fw','_fy','_fb','_fbl','_fr','_fc','_fg','_fm','_fEx_w','_fEx_y','_fEx_b','_fEx_bl','_fEx_r','_fEx_c','_fEx_g','_fEx_m']
#########################
##########################


def SshToolsLogo():
    print (f"{_fy}┌────────────────────────────────────────────────────────────────────────────────────────────────────────┐{_reset}")
    print (f"{_fy}│ ──{_fb}╔═══╦═══╦╗{_fy}─{_fb}╔╗╔════╗{_fy}────{_fb}╔╗{_fy}─────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}║╔═╗║╔═╗║║{_fy}─{_fb}║║║╔╗╔╗║{_fy}────{_fb}║║{_fy}─────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}║╚══╣╚══╣╚═╝║╚╝║║╠╩═╦══╣║╔══╗{_fy}─────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}╚══╗╠══╗║╔═╗║{_fy}──{_fb}║║║╔╗║╔╗║║║══╣{_fy}─────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}║╚═╝║╚═╝║║{_fy}─{_fb}║║{_fy}──{_fb}║║║╚╝║╚╝║╚╬══║{_fy}─────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}╚═══╩═══╩╝{_fy}─{_fb}╚╝{_fy}──{_fb}╚╝╚══╩══╩═╩══╝{_fy}─────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}└────────────────────────────────────────────────────────────────────────────────────────────────────────┘{_reset}")
    
def SshToolsLogoScp():
    print (f"{_fy}┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐{_reset}")
    print (f"{_fy}│ ──{_fb}╔═══╦═══╦╗{_fy}─{_fb}╔╗╔════╗{_fy}────{_fb}╔╗{_fy}──────────────────────────────────────────────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}║╔═╗║╔═╗║║{_fy}─{_fb}║║║╔╗╔╗║{_fy}────{_fb}║║{_fy}──────────────────────────────────────────────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}║╚══╣╚══╣╚═╝║╚╝║║╠╩═╦══╣║╔══╗{_fy}──────────────────────────────────────────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}╚══╗╠══╗║╔═╗║{_fy}──{_fb}║║║╔╗║╔╗║║║══╣{_fy}──────────────────────────────────────────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}║╚═╝║╚═╝║║{_fy}─{_fb}║║{_fy}──{_fb}║║║╚╝║╚╝║╚╬══║{_fy}──────────────────────────────────────────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}│ ──{_fb}╚═══╩═══╩╝{_fy}─{_fb}╚╝{_fy}──{_fb}╚╝╚══╩══╩═╩══╝{_fy}──────────────────────────────────────────────────────────────────────────────────────────────────────────────── │{_reset}")
    print (f"{_fy}└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘{_reset}")
    

def ScpProgress(SourceLst,destinationLst,SourcePath,DestPath,mode):
    _clearClr = f'{_fbl}{_bw}'
    _SrcClr = f'{_fbl}{_bg}'
    _DstClr = f'{_fbl}{_bc}'
    _BColor = f'{_fy}'
    _SourceIP = lib.BaseFunction.GetValue(SourceLst,"IP",verbus=False,ReturnValueForNone='')
    _DestIP = lib.BaseFunction.GetValue(destinationLst,"IP",verbus=False,ReturnValueForNone='')

    _SourceIP_Label = f'{_clearClr}{lib.AsciArt.FnAlignmentStr(originalString="From",target_length=20)}{_reset}'
    _DestIP_Label = f'{_clearClr}{lib.AsciArt.FnAlignmentStr(originalString="To",target_length=20)}{_reset}'
    _SourceFile_Label = f'{_clearClr}{lib.AsciArt.FnAlignmentStr(originalString="File Name",target_length=46)}{_reset}'
    _DestFile_Label = f'{_clearClr}{lib.AsciArt.FnAlignmentStr(originalString=" Destination Path",target_length=46)}{_reset}'
        
    if _SourceIP != '':        
        _SourceIP_Label = f'{_SrcClr}{lib.AsciArt.FnAlignmentStr(originalString=_SourceIP,target_length=20)}{_reset}'         
    if SourcePath != '':
        _SourceFile_Label = f'{_SrcClr}{lib.AsciArt.FnAlignmentStr(originalString=SourcePath,target_length=46)}{_reset}'
        
    if _DestIP != '':        
        _DestIP_Label = f'{_DstClr}{lib.AsciArt.FnAlignmentStr(originalString=_DestIP,target_length=20)}{_reset}'
    if DestPath != '':
        _DestFile_Label = f'{_DstClr}{lib.AsciArt.FnAlignmentStr(originalString=DestPath,target_length=46)}{_reset}'
    
    LableStr = f'{_SourceIP_Label} / {_SourceFile_Label} --> {_DestIP_Label} / {_DestFile_Label}'
    
    _SourceIP_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString=" ",target_length=20)}{_reset}'
    _DestIP_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString=" ",target_length=20)}{_reset}'
    _SourceFile_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString=" ",target_length=46)}{_reset}'
    _DestFile_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString=" ",target_length=46)}{_reset}'
    

    if mode == 'from':
        _SourceIP_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString="⬇️  ⬇️  ⬇️",target_length=20)}{_reset}'
    elif mode == 'sfile':
        _SourceFile_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString="⬇️  ⬇️  ⬇️",target_length=46)}{_reset}'
    elif mode == 'to':
        _DestIP_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString="⬇️  ⬇️  ⬇️",target_length=20)}{_reset}'
    elif mode == 'dfile':
        _DestFile_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString="⬇️  ⬇️  ⬇️",target_length=46)}{_reset}'
    elif mode == 'both':
        _SourceIP_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString="⬇️  ⬇️  ⬇️",target_length=21)}{_reset}'
        _SourceFile_GUID = f'{_reset}{lib.AsciArt.FnAlignmentStr(originalString="⬇️  ⬇️  ⬇️",target_length=48)}{_reset}'    
        
    Guideline = f'{_SourceIP_GUID}   {_SourceFile_GUID}      {_DestIP_GUID}     {_DestFile_GUID}'
    if mode == 'confirm':
        Guideline = f"{_B}{_by}{_fbl}{lib.AsciArt.FnAlignmentStr(originalString='are you sure ?',target_length=143)}{_reset}"
        
    spaceline = lib.AsciArt.FnAlignmentStr(originalString=" ",target_length=145)
    #lib.AsciArt.BorderIt(Text=LableStr,WidthBorder=150)
    LineUp = '┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐'
    LineDown = '└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘'
    print(f'{_BColor}{LineUp}{_reset}')
    if mode != '':
        print(f'{_BColor}│ {Guideline} {_BColor}│{_reset}')
        print(f'{_BColor}│{spaceline}{_BColor}│{_reset}')
    print(f'{_BColor}│{_reset} {LableStr} {_BColor}│{_reset}')
    print(f'{_BColor}{LineDown}{_reset}')


if __name__ == "__main__":    
    print(f"{_B}{_fy}You should not run this file directly")


